docs/ironsworn-rpg.org
#+TITLE:  Ironsworn
#+AUTHOR: Howard X. Abrams
#+DATE:   2021-12-21 December
#+TAGS:   rpg
#+PROPERTY:    header-args:sh :tangle no
#+PROPERTY:    header-args:emacs-lisp  :tangle ../rpgdm-ironsworn.el
#+PROPERTY:    header-args   :results none   :eval no-export   :comments no

#+OPTIONS:     num:nil toc:nil todo:nil tasks:nil tags:nil date:nil
#+OPTIONS:     skip:nil author:nil email:nil creator:nil timestamp:nil
#+INFOJS_OPT:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js

Can I make Ironsworn-specific interface and dice rolls?

First let's load my previous code, assuming that we have added this directory to =load-path=:
#+BEGIN_SRC emacs-lisp
(require 'rpgdm)
#+END_SRC

* Dice Roller
How should the results look like when rolling? Perhaps like this formatted string:

#+BEGIN_SRC emacs-lisp
  (defun rpgdm-ironsworn--results (action modifier one-challenge two-challenge)
    (let* ((action-results (+ action modifier))
           (str-results (cond
                         ((and (> action-results one-challenge) (> action-results two-challenge))
                          (propertize "Strong hit" 'face '(:foreground "green")))
                         ((or  (> action-results one-challenge) (> action-results two-challenge))
                          (propertize "Weak hit" 'face '(:foreground "yellow")))
                         (t (propertize "Miss" 'face '(:foreground "red")))))
           (matched-msg  (if (= one-challenge two-challenge)
                             (propertize " ← Create a Twist" 'face '(:foreground "orange"))
                           "")))
      (format "%s %s %d %s %d %s %d %s %d %s" str-results
              (propertize "::" 'face '(:foreground "#888"))
              action
              (propertize "+" 'face '(:foreground "#888"))
              modifier
              (propertize "→" 'face '(:foreground "#888"))
              one-challenge
              (propertize "/" 'face '(:foreground "#888"))
              two-challenge matched-msg)))
#+END_SRC

So the following should work:

#+BEGIN_SRC emacs-lisp :tangle no
(rpgdm-ironsworn--results 3 2 4 1)
(rpgdm-ironsworn--results 3 2 8 1)
(rpgdm-ironsworn--results 3 2 8 6)
(rpgdm-ironsworn--results 3 2 6 6)
#+END_SRC

The basic interface will query for a modifer, and then display the results:
#+BEGIN_SRC emacs-lisp :results silent
  (defun rpgdm-ironsworn-roll (modifier)
    "Display a Hit/Miss message based on comparing a d6 action
  roll (added to MODIFIER) vs. two d10 challenge dice."
    (interactive "nModifier: ")
    (let ((one-challenge (rpgdm--roll-die 10))
          (two-challenge (rpgdm--roll-die 10))
          (action-roll   (rpgdm--roll-die 6)))
      (rpgdm-message (rpgdm-ironsworn--results action-roll modifier
                                               one-challenge two-challenge))))
#+END_SRC

Rolling against the progress just means we need to request that value instead of rolling the d6:

#+BEGIN_SRC emacs-lisp
  (defun rpgdm-ironsworn-progress-roll (progress-value)
    "Display a Hit/Miss message based on comparing the PROGRESS-VALUE
  to rolling two d10 challenge dice."
    (interactive "nCurrent Progress Value: ")
    (let ((one-challenge (rpgdm--roll-die 10))
          (two-challenge (rpgdm--roll-die 10)))
      (rpgdm-message (rpgdm-ironsworn--results progress-value 0
                                               one-challenge two-challenge))))
#+END_SRC
* Characters
But what might be nice is to have a character sheet that has the default modifiers:

Internal representation of a character should be pretty simple:
#+BEGIN_SRC emacs-lisp
  (define-hash-table-test 'str-or-keys
    (lambda (a b)
      (string-equal
       (downcase
        (if (symbolp a) (symbol-name a) a))
       (downcase
        (if (symbolp b) (symbol-name b) b))))

    (lambda (s) (sxhash-equal (downcase
       (if (symbolp s) (symbol-name s) s)))))

  (defvar rpgdm-ironsworn-character (make-hash-table :test 'str-or-keys)
    "Stats and attributes for the currently loaded character")
#+END_SRC
And a function to set them all.  We may want another function that could parse an Org table or something.
#+BEGIN_SRC emacs-lisp :results silent
  (cl-defun rpgdm-ironsworn-character (&key edge heart iron shadow wits
                                            (health 5) (spirit 5) (supply 5)
                                            (momentum 2))
    "Store the player character's stats, as well as set up the defaults for the others."
    (clrhash rpgdm-ironsworn-character)
    ;; (setq rpgdm-ironsworn-character (make-hash-table :test 'str-or-keys))
    (puthash 'edge edge rpgdm-ironsworn-character)
    (puthash 'heart heart rpgdm-ironsworn-character)
    (puthash 'iron iron rpgdm-ironsworn-character)
    (puthash 'shadow shadow rpgdm-ironsworn-character)
    (puthash 'wits wits rpgdm-ironsworn-character)

    (puthash 'health health rpgdm-ironsworn-character)
    (puthash 'spirit spirit rpgdm-ironsworn-character)
    (puthash 'supply supply rpgdm-ironsworn-character)
    (puthash 'momentum momentum rpgdm-ironsworn-character))
#+END_SRC

This allows us to define our character:

#+BEGIN_SRC emacs-lisp :tangle no :results silent
(rpgdm-ironsworn-character :edge 1 :heart 2 :iron 1 :shadow 2 :wits 3)
#+END_SRC

We need to modify the values stored.
#+BEGIN_SRC emacs-lisp :results silent
  (defun rpgdm-ironsworn-adjust-health (health-adj)
    "Increase or decrease the current character's health by HEALTH-ADJ."
    (interactive "nHealth Adjustment: ")
    (puthash 'health
             (+ (gethash 'health rpgdm-ironsworn-character 5) health-adj)
             rpgdm-ironsworn-character))

  (defun rpgdm-ironsworn-adjust-spirit (spirit-adj)
    "Increase or decrease the current character's spirit by SPIRIT-ADJ."
    (interactive "nSpirit Adjustment: ")
    (puthash 'spirit
             (+ (gethash 'spirit rpgdm-ironsworn-character 5) spirit-adj)
             rpgdm-ironsworn-character))

  (defun rpgdm-ironsworn-adjust-supply (supply-adj)
    "Increase or decrease the current character's supply by SUPPLY-ADJ."
    (interactive "nSupply Adjustment: ")
    (puthash 'supply
             (+ (gethash 'supply rpgdm-ironsworn-character 5) supply-adj)
             rpgdm-ironsworn-character))

  (defun rpgdm-ironsworn-adjust-momentum (momentum-adj)
    "Increase or decrease the current character's momentum by MOMENTUM-ADJ."
    (interactive "nMomentum Adjustment: ")
    (puthash 'momentum
             (+ (gethash 'momentum rpgdm-ironsworn-character 5) momentum-adj)
             rpgdm-ironsworn-character))
#+END_SRC

Perhaps we need a special way to display these changing stats?

#+BEGIN_SRC emacs-lisp
  (defun rpgdm-ironsworn--display-stat (stat)
    (let* ((value (gethash stat rpgdm-ironsworn-character 5))
           (s-val (number-to-string value))
           (color (cond
                   ((< value 1) "red")
                   ((< value 3) "orange")
                   ((< value 4) "yellow")
                   (t "green"))))
      (propertize s-val 'face `(:foreground ,color))))

  (defun rpgdm-ironsworn-character-display ()
    "Easily display the character's stats and other things."
    (interactive)
    (rpgdm-message "Edge: %d  Heart: %d  Iron: %d  Shadow: %d  Wits: %d
  Health: %s  Spirit: %s  Supply: %s  Momentum: %d"
                   (gethash 'edge rpgdm-ironsworn-character 0)
                   (gethash 'heart rpgdm-ironsworn-character 0)
                   (gethash 'iron rpgdm-ironsworn-character 0)
                   (gethash 'shadow rpgdm-ironsworn-character 0)
                   (gethash 'wits rpgdm-ironsworn-character 0)

                   (rpgdm-ironsworn--display-stat 'health)
                   (rpgdm-ironsworn--display-stat 'spirit)
                   (rpgdm-ironsworn--display-stat 'supply)

                   (gethash 'momentum rpgdm-ironsworn-character 5)))
#+END_SRC
