rpgdm-ironsworn.el

(defun rpgdm-ironsworn-roll-stat (stat modifier)
  "Roll an action based on a loaded character's STAT with a MODIFIER."
  (interactive (list (completing-read "Stat Modifier: " '(Edge Heart Iron Shadow Wits))
                     (read-string "Other Modifier: ")))
  (let ((all-mods (+ (gethash stat rpgdm-ironsworn-character)
                     (string-to-number modifier))))
    (rpgdm-ironsworn-roll all-mods)))

(defun rpgdm-ironsworn-roll-edge (modifier)
  "Roll an action based on a loaded character's Edge stat with a MODIFIER."
  (interactive (list (read-string "Edge + Modifier: ")))
  (rpgdm-ironsworn-roll-stat 'edge modifier))

(defun rpgdm-ironsworn-roll-heart (modifier)
  "Roll an action based on a loaded character's Heart stat with a MODIFIER."
  (interactive (list (read-string "Heart + Modifier: ")))
  (rpgdm-ironsworn-roll-stat 'heart modifier))

(defun rpgdm-ironsworn-roll-iron (modifier)
  "Roll an action based on a loaded character's Iron stat with a MODIFIER."
  (interactive (list (read-string "Iron + Modifier: ")))
  (rpgdm-ironsworn-roll-stat 'iron modifier))

(defun rpgdm-ironsworn-roll-shadow (modifier)
  "Roll an action based on a loaded character's Shadow stat with a MODIFIER."
  (interactive (list (read-string "Shadow + Modifier: ")))
  (rpgdm-ironsworn-roll-stat 'shadow modifier))

(defun rpgdm-ironsworn-roll-wits (modifier)
  "Roll an action based on a loaded character's Wits stat with a MODIFIER."
  (interactive (list (read-string "Wits + Modifier: ")))
  (rpgdm-ironsworn-roll-stat 'wits modifier))

(defun rpgdm-ironsworn-oracle-action-theme ()
  "Rolls on two tables at one time."
  (interactive)
  (let ((action (rpgdm-tables-choose "actions"))
        (theme  (rpgdm-tables-choose "themes")))
    (rpgdm-message "%s / %s" action theme)))

(defun rpgdm-ironsworn-oracle-npc ()
  (interactive)
  (let ((name        (rpgdm-tables-choose "names-ironlander"))
        (goal        (rpgdm-tables-choose "character-goal"))
        (role        (rpgdm-tables-choose "character-role"))
        (activity    (rpgdm-tables-choose "character-activity"))
        (description (rpgdm-tables-choose "character-descriptor"))
        (disposition (rpgdm-tables-choose "character-disposition")))
    (rpgdm-message "%s, %s %s (Activity: %s  Disposition: %s  Goal: %s)"
                   name description role activity disposition goal)))

(defun rpgdm-ironsworn-oracle-combat ()
  (interactive)
  (let ((action (rpgdm-tables-choose "combat-action"))
        (method (rpgdm-tables-choose "combat-event-method"))
        (target (rpgdm-tables-choose "combat-event-target")))
    (rpgdm-message "%s %s or %s" method target action)))

(defun rpgdm-ironsworn-oracle-feature ()
  "Rolls on two tables at one time for a Site's feature."
  (interactive)
  (let ((aspect (rpgdm-tables-choose "feature-aspect"))
        (focus  (rpgdm-tables-choose "feature-focus")))
    (rpgdm-message "%s / %s" aspect focus)))

(defun rpgdm-ironsworn-oracle-site-nature ()
  "Rolls on two tables at one time for a random Site."
  (interactive)
  (let* ((theme  (rpgdm-tables-choose "site-theme"))
         (domain (rpgdm-tables-choose "site-domain"))
         (place  (downcase domain))
         (name   (rpgdm-ironsworn-oracle-site-name place)))
    (rpgdm-message "%s %s :: %s" theme domain name)))

(defun rpgdm-ironsworn-oracle-site-name (&optional place-type)
  "Rolling on multiple tables to return a random site name."
  (interactive (list (completing-read "Place type: "
                                      '(barrow cavern icereach mine pass ruin
                                               sea-cave shadowfen stronghold
                                               tanglewood underkeep))))
  (unless place-type
    (setq place-type "unknown"))
  (let ((description (rpgdm-tables-choose "site-name-description"))
        (detail (rpgdm-tables-choose "site-name-detail"))
        (namesake (rpgdm-tables-choose "site-name-namesake"))
        (place  (rpgdm-tables-choose (format "site-name-place-%s" place-type)))
        (roll   (rpgdm--roll-die 100)))
    (rpgdm-message
     (cond
      ((<= roll 25) (format "%s %s" description place))
      ((<= roll 50) (format "%s of %s" place detail))
      ((<= roll 70) (format "%s of %s %s" place description detail))
      ((<= roll 80) (format "%s of %s's %s" place namesake detail))
      ((<= roll 85) (format "%s's %s" namesake place))
      ((<= roll 95) (format "%s %s of %s" description place namesake))
      (t            (format "%s of %s" place namesake))))))

(defvar rpgdm-ironsworn-oracle-threats '("Burgeoning Conflict" "Ravaging Horde"
                                         "Cursed Site" "Malignant Plague"
                                         "Scheming Leader" "Zealous Cult"
                                         "Environmental Calamity" "Power-Hungry Mystic"
                                         "Rampaging Creature")
  "A list of threats that correspond to tables")

(defun rpgdm-ironsworn-oracle-threat-goal (&optional category)
  "Given a CATEGORY, display a threat goal."
  (interactive (list (completing-read "Threat: " rpgdm-ironsworn-oracle-threats)))
  (unless category
    (setq category (seq-random-elt rpgdm-ironsworn-oracle-threats)))
  (let ((table-name (format "threat-%s" (downcase (string-replace " " "-" category)))))
    (rpgdm-message "%s: %s" category (rpgdm-tables-choose table-name))))

(rpgdm-ironsworn-oracle-threat-goal)

(defun rpgdm-ironsworn-oracle ()
