rpgdm-ironsworn.el
  "Given a LIKLIHOOD as a single character, return weighted coin flip."
  (interactive)
  (let* ((prompt "What are the odds?
  c) Almost Certain  l) Likely  h) 50/50  u) Unlikely  n) Small Chance ")
         (odds (read-char prompt))
         (roll (rpgdm--roll-die 100))
         (yes! (when (or (and (= roll 11) (eq odds ?c))
                         (and (= roll 26) (eq odds ?l))
                         (and (= roll 51) (eq odds ?h))
                         (and (= roll 76) (eq odds ?u))
                         (and (= roll 91) (eq odds ?n)))
                 t))
         (yes  (when (or (and (> roll 11) (eq odds ?c))
                         (and (> roll 26) (eq odds ?l))
                         (and (> roll 51) (eq odds ?h))
                         (and (> roll 76) (eq odds ?u))
                         (and (> roll 91) (eq odds ?n)))
                 t)))
    (rpgdm-message "%s %s %s"
                   (if yes! "Extreme" "")
                   (if yes "Yes" "No")
                   (if yes! "or a twist." ""))))

(defhydra hydra-rpgdm (:color blue :hint nil)
  "
    ^Dice^                              ^Adjust^      ^Oracles/Tables^                                   ^Moving^              ^Messages^
 ----------------------------------------------------------------------------------------------------------------------------------------------------
    _d_: Roll Dice  _D_: Progress Dice  _H_: Health   _z_: Yes/No Oracle _a_: Action/Theme  _n_: NPC      _o_: Links            ⌘-‿: Show Stats
    _e_: Roll Edge  _s_: Roll Shadow    _S_: Spirit   _c_: Show Oracle   _c_: Combat Action _f_: Feature  _J_/_K_: Page up/dn     ⌘-l: Last Results
    _h_: Roll Heart _w_: Roll Wits      _G_: Supply   _O_: Other Oracle  _p_: Place Name    _P_: Place    _N_/_W_: Narrow/Widen   ⌘-k: ↑ Previous
    _i_: Roll Iron  _x_: Roll Stat      _M_: Momentum _T_: Load Oracles  _t_: Threat Goal                                   ⌘-j: ↓ Next   "
  ("d" rpgdm-ironsworn-roll)    ("D" rpgdm-ironsworn-progress-roll)
  ("z" rpgdm-ironsworn-oracle)  ("O" rpgdm-oracle)

  ("a" rpgdm-ironsworn-oracle-action-theme)
  ("n" rpgdm-ironsworn-oracle-npc)
  ("c" rpgdm-ironsworn-oracle-combat)
  ("f" rpgdm-ironsworn-oracle-feature)
  ("P" rpgdm-ironsworn-oracle-site-nature)
  ("p" rpgdm-ironsworn-oracle-site-name)
  ("t" rpgdm-ironsworn-oracle-threat-goal)

  ("e" rpgdm-ironsworn-roll-edge)
  ("h" rpgdm-ironsworn-roll-heart)
  ("i" rpgdm-ironsworn-roll-iron)
  ("s" rpgdm-ironsworn-roll-shadow)
  ("w" rpgdm-ironsworn-roll-wits)
  ("x" rpgdm-ironsworn-roll-stat :color pink)

  ("H" rpgdm-ironsworn-adjust-health :color pink)
  ("S" rpgdm-ironsworn-adjust-spirit :color pink)
  ("G" rpgdm-ironsworn-adjust-supply :color pink)
  ("M" rpgdm-ironsworn-adjust-momentum :color pink)

  ("T" rpgdm-tables-load)       ("c" rpgdm-tables-choose)     ("C" rpgdm-tables-choose :color pink)
  ("o" ace-link)                ("N" org-narrow-to-subtree)   ("W" widen)
  ("K" scroll-down :color pink)             ("J" scroll-up :color pink)

  ("s-SPC" rpgdm-ironsworn-character-display)
  ("C-m" rpgdm-last-results :color pink)
  ("C-n" rpgdm-last-results-next :color pink)
  ("C-p" rpgdm-last-results-previous :color pink)
  ("s-l" rpgdm-last-results :color pink)
  ("s-j" rpgdm-last-results-next :color pink)
  ("s-k" rpgdm-last-results-previous :color pink)

  ("q" nil "quit") ("<f12>" nil))

(provide 'rpgdm-ironsworn)
;;; rpgdm-ironsworn.el ends here
